Repository: geodro/Junction
Catalog: po/*.po
Languages: ro

source: Application chooser
ro: Selector de aplicații

source: Junction lets you choose the application to open files and links.
ro: Junction vă permite să alegeți aplicația pentru a deschide fișiere și link-uri.

source: After installing make sure to launch the application.
ro: După instalare, asigurați-vă că lansați aplicația.

source: Junction will pop up automatically when you open a link in a desktop application. Use the mouse or keyboard navigation to choose the application to open the link or file with.
ro: Junction va apărea automat când deschideți un link într-o aplicație desktop. Utilizați navigarea cu mouse-ul sau tastatura pentru a alege aplicația cu care să deschideți linkul sau fișierul.

source: Features:
ro: Caracteristici:

source: Choose the application to open with
ro: Alegeți aplicația cu care să deschideți

source: Show the location before opening
ro: Arată locația înainte de deschidere

source: Edit the URL before opening
ro: Editați adresa URL înainte de deschidere

source: Show a hint for insecure link
ro: Afișați un indiciu pentru link nesigur

source: Keyboard navigation
ro: Navigare prin tastatură

source: Middle click to open in multiple applications
ro: Faceți clic din mijloc pentru a deschide în mai multe aplicații

source: Choose the browser to open the link with
ro: Alegeți browserul cu care deschideți linkul

source: Choose the application to open the image with
ro: Alegeți aplicația cu care deschideți imaginea

source: Junction features great support for keyboard
ro: Junction oferă un suport excelent pentru tastatură

source: Desktop actions are supported too
ro: Acțiunile desktop sunt și ele acceptate

source: Add an option "Reveal in Folder" for files
ro: Adăugați o opțiune „Afișare în dosar” pentru fișiere

source: Reveal document portal file paths
ro: Dezvăluie căile fișierelor portal de documente

source: Bug fix for desktop actions
ro: Remediere erori pentru acțiunile desktop

source: Bug fix when opening with Libreoffice
ro: Remediere erori la deschiderea cu Libreoffice

source: Support desktop actions
ro: Sprijină acțiuni desktop

source: Support snap applications
ro: Suportă aplicații snap

source: Improve design
ro: Îmbunătățiți designul

source: New icon
ro: Pictogramă nouă

source: Add a x-junction:// protocol API
ro: Adăugați un API de protocol x-junction://

source: Do not automatically set as default application
ro: Nu setați automat ca aplicație implicită

source: Fix missing options
ro: Remediați opțiunile lipsă

source: Limit the number of options to 4
ro: Limitați numărul de opțiuni la 4

source: Add an option to open with any application
ro: Adăugați o opțiune pentru a deschide cu orice aplicație

source: Add a System Information panel in the about dialog
ro: Adăugați un panou Informații de sistem în caseta de dialog despre

source: Fix for applications that do not support URIs
ro: Remediere pentru aplicațiile care nu acceptă URI-uri

source: Add an option to display application names
ro: Adăugați o opțiune pentru a afișa numele aplicațiilor

source: Add a menu button
ro: Adăugați un buton de meniu

source: Improve keyboard usage
ro: Îmbunătățiți utilizarea tastaturii

source: Improve CLI usage
ro: Îmbunătățiți utilizarea CLI

source: Support opening multiple URIs
ro: Acceptă deschiderea mai multor URI-uri

source: Support D-Bus activation
ro: Acceptă activarea D-Bus

source: Use libadwaita
ro: Folosește libadwaita

source: Fix for missing applications
ro: Remediere pentru aplicațiile lipsă

source: Add a Shortcuts window - accessible with &lt;Ctrl&gt;?
ro: Adăugați o fereastră de Comenzi rapide - accesibilă cu &lt;Ctrl&gt;?

source: This is the first release of Junction. We hope you like it.
ro: Aceasta este prima lansare a lui Junction. Sperăm să vă placă.

source: translator-credits
ro: George Dumitrescu <dumitrescugeorge@gmail.com>

source: Reveal
ro: Arată

source: Reveal in Folder
ro: Arată în dosar

source: All Applications
ro: Toate aplicațiile

source: View All
ro: Vezi tot

source: This site has no security. An attacker could see any information you send, or control the content that you see.
ro: Acest site nu are securitate. Un atacator poate vedea orice informație pe care o trimiteți sau poate controla conținutul pe care îl vedeți.

source: Discard and close
ro: Aruncați și închideți

source: Copy to Clipboard
ro: Copiați în clipboard

source: Select next/previous application
ro: Selectați aplicația următoare/anterioră

source: Open with selected application
ro: Deschideți cu aplicația selectată

source: Open with selected application and stay active
ro: Deschideți cu aplicația selectată și rămâne activ

source: Open with application at position
ro: Deschide cu aplicația la poziția

source: Keyboard Shortcuts
ro: Comenzi rapide de la tastatură

source: Quit
ro: Ieși

source: Test Junction
ro: Testează Junction

source: Set Junction as default for Web
ro: Setați Junction ca implicit pentru Web

source: About Junction
ro: Despre Junction

source: Show names
ro: Afișați numele
